{"id": "1741", "parent_exercise_id": null, "name": "Algorithm", "slug": "samvaad-tech-201__Algorithm", "sequence_num": 3000, "review_type": "peer", "solution": null, "content": "**First you have to watch this video**\n\n@[youtube](0IAPZzGSbME&list=PLDN4rrl48XKpZkf03iYFl-O29szjTrs_O)\n\n**Algorithm**\n\nAn algorithm is a fancy to-do list for a computer. Algorithms take in zero or more inputs and give back one or more outputs.\n\nA recipe is a good example of an algorithm because it tells you what you need to do step by step. It takes inputs (ingredients) and produces an output (the completed dish).\n\nThe words 'algorithm' and 'algorism' come from the name of a Persian mathematician called Al-Khwārizmī (Persian: خوارزمی‎‎, c. 780–850).\n\nAn algorithm is a sequence of unambiguous instructions for solving a problem, i.e., for obtaining a required output for any legitimate(acceptable) input in a finite amount of time [Levitin, p. 3]. ... Indeed, algorithms are commonly expressed either in a programming language like Pascal or C++, or a pseudocode.\n\nTo write a computer program, you have to tell the computer, step by step, exactly what you want it to do. The computer then \"executes\" the program, following each step mechanically, to accomplish the end goal. ... That's where computer algorithms come in. The algorithm is the basic technique used to get the job done.\n\nA good algorithm should produce the correct outputs for any set of legal inputs. A good algorithm should execute efficiently with the fewest number of steps as possible. A good algorithm should be designed in such a way that others will be able to understand it and modify it to specify solutions to additional problems.\n\nThe characteristics of a good algorithm are:\n\nPrecision – the steps are precisely stated(defined).\n\nUniqueness – results of each step are uniquely definedand only depend on the input and the result of the precedingsteps.\n\nFiniteness – the algorithm stops after a finite number ofinstructions are executed.\n\nInput – the algorithm receives input.\n\nHere I've put together a little list, in no particular order.\n\nMerge Sort, Quick Sort and Heap Sort. ...\n\nFourier Transform and Fast Fourier Transform. ...\n\nDijkstra's algorithm. ...\n\nRSA algorithm. ...\n\nSecure Hash Algorithm. ...\n\nInteger factorization. ...\n\nLink Analysis. ...\n\nProportional Integral\n\n**If you want to know more about algorithm you can watch these videos.**\n\n@[youtube](FbYzBWdhMb0)\n\n@[youtube](vOEN65nm4YU)\n\n**Now you have to disccuss about these topics at least 30min in pairs. **\n\n\n**Remmember these points also while disccussion.**\n\n1. What is algorithm?\n\n2. What are the types of algorithm?\n\n3. Is a recipe an algorithm? Discuss in detail.\n\n4. What is the use of algorithm?\n\n5. What is the sequence of algorithm?\n\n6. What are the advantages of algorithm?\n\n\n\n\n\n**Tips:**\n\n1 - You can on subtitles/captions while watching youtube video.\n\n2 -You can increase or decrease speed of the video if you face any difficult.\n", "submission_type": null, "github_link": "https://github.com/navgurukul/newton/tree/master/samvaad-tech-201/Algorithm.md"}